[Killed] StringLiteral
main/components/RequestTypes/RequestTypeForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RequestTypeForm";
+  const testIdPrefix = "";
 
   return (
killedBy: RequestForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestTypes/RequestTypeForm.js:25:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col xs="3">
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: RequestForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RequestTypes/RequestTypeForm.js:25:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col xs="3">
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={testIdPrefix + "-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: RequestForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RequestTypes/RequestTypeForm.js:49:28
               id="requestType"
               type="text"
               isInvalid={Boolean(errors.requestType)}
-              {...register("requestType", {
+              {...register("", {
                 required: "Request Type is required.",
                 maxLength: {
killedBy: RequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
