[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:39:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/requests">
-                    All Recommendation Requests
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                  <NavDropdown.Item href="/admin/requests">
+                    All Recommendation Requests
+                  </NavDropdown.Item>
+                </NavDropdown>}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:39:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/requests">
-                    All Recommendation Requests
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:51:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
-                <NavDropdown
-                  title="Settings"
-                  id="appnavbar-settings-dropdown"
-                  data-testid="appnavbar-settings-dropdown"
-                >
-                  <NavDropdown.Item href="/settings/requesttypes">
-                    Request Types
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-settings-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:51:17
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
+              {(hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) && (
                 <NavDropdown
                   title="Settings"
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-settings-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:73:16
                   </Nav.Link>
                 </>
               ) : null}
-              {systemInfo?.springH2ConsoleEnabled && (
-                <Nav.Link href="/h2-console">H2Console</Nav.Link>
-              )}
+              {false}
               {systemInfo?.showSwaggerUILink && (
                 <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:73:16
                   </Nav.Link>
                 </>
               ) : null}
-              {systemInfo?.springH2ConsoleEnabled && (
+              {systemInfo.springH2ConsoleEnabled && (
                 <Nav.Link href="/h2-console">H2Console</Nav.Link>
               )}
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'springH2ConsoleEnabled')
