[Killed] LogicalOperator
main/components/RequestTypes/RequestTypeTable.js:50:5
   ];
 
   if (
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_INSTRUCTOR")
+    hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")
   ) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
killedBy: RequestTypeTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/RequestTypes/RequestTypeTable.js:50:5
   ];
 
   if (
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_INSTRUCTOR")
+    false
   ) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
killedBy: RequestTypeTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RequestTypes/RequestTypeTable.js:52:5
   if (
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_INSTRUCTOR")
-  ) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  ) {}
 
   return (
killedBy: RequestTypeTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RequestTypes/RequestTypeTable.js:53:39
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_INSTRUCTOR")
   ) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("Edit", "", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: RequestTypeTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/RequestTypes/RequestTypeTable.js:53:31
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_INSTRUCTOR")
   ) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("", "primary", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: RequestTypeTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
