[Killed] StringLiteral
src/main/utils/requestTypeUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/requesttypes",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: requestTypeUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
