[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:78:28
               id="requesterName"
               type="text"
               isInvalid={Boolean(errors.requesterName)}
-              {...register("requesterName", {
+              {...register("", {
                 required: true,
               })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:79:27
               type="text"
               isInvalid={Boolean(errors.requesterName)}
               {...register("requesterName", {
-                required: true,
+                required: false,
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: Requester Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:83:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterName && "Requester Name is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: Requester Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:83:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterName && "Requester Name is required. "}
+              {errors.requesterName || "Requester Name is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Name/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="requesterName"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:97:46
               id="professorEmail"
               type="email"
               isInvalid={Boolean(errors.professorEmail)}
-              {...register("professorEmail", {
-                required: true,
-              })}
+              {...register("professorEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: Professor Email is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:117:27
               type="text"
               isInvalid={Boolean(errors.professorName)}
               {...register("professorName", {
-                required: true,
+                required: false,
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: Professor Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:121:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorName && "Professor Name is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: Professor Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:121:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorName && "Professor Name is required. "}
+              {errors.professorName || "Professor Name is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Professor Name/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="professorName"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:137:43
               id="requestType"
               type="string"
               isInvalid={Boolean(errors.requestType)}
-              {...register("requestType", {
-                required: "Request Type is required.",
-              })}
+              {...register("requestType", {})}
             >
               <option value="">-- Select an Option --</option>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: Request Type is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:191:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.submissionDate?.message}
+              {errors.submissionDate.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
