[Killed] BlockStatement
src/main/pages/AdminRequestsPage.js:5:33
 import RequestsTable from "main/components/Requests/RequestsTable";
 
 import { useBackend } from "main/utils/useBackend";
-const AdminRequestsPage = () => {
-  const {
-    data: requests = [],
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/recommendationrequests/alladmin"],
-    { method: "GET", url: "/api/recommendationrequests/alladmin" },
-    [],
-  );
-
-  console.log({ _error, _status, requests });
-
-  return (
-    <BasicLayout>
-      <h2>Recommendation Requests</h2>
-      <RequestsTable requests={requests} />
-    </BasicLayout>
-  );
-};
+const AdminRequestsPage = () => {};
 
 export default AdminRequestsPage;
killedBy: AdminRequestsPage tests renders without crashing on three requests
statusReason: Error: Unable to find an element with the text: Recommendation Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ArrayDeclaration
src/main/pages/AdminRequestsPage.js:7:22
 import { useBackend } from "main/utils/useBackend";
 const AdminRequestsPage = () => {
   const {
-    data: requests = [],
+    data: requests = ["Stryker was here"],
     error: _error,
     status: _status,

[Killed] ArrayDeclaration
src/main/pages/AdminRequestsPage.js:14:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequests/alladmin"],
     { method: "GET", url: "/api/recommendationrequests/alladmin" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: AdminRequestsPage tests renders empty table when backend unavailable
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RequestsTable-cell-row-0-col-id" role="cell" /> instead
