[Killed] ObjectLiteral
main/components/Requests/RequestsTable.js:16:3
     Header: "Professor Id",
     accessor: "professorId",
   },
-  {
-    Header: "Request Type",
-    accessor: "requestType",
-  },
+  {},
   {
     Header: "Details",
killedBy: RequestsTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Requests/RequestsTable.js:20:3
     Header: "Request Type",
     accessor: "requestType",
   },
-  {
-    Header: "Details",
-    accessor: "details",
-  },
+  {},
   {
     Header: "Needed By Date",
killedBy: RequestsTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Requests/RequestsTable.js:24:3
     Header: "Details",
     accessor: "details",
   },
-  {
-    Header: "Needed By Date",
-    accessor: "neededByDate",
-  },
+  {},
   {
     Header: "Submission Date",
killedBy: RequestsTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Requests/RequestsTable.js:25:13
     accessor: "details",
   },
   {
-    Header: "Needed By Date",
+    Header: "",
     accessor: "neededByDate",
   },
killedBy: RequestsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Needed By Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Requests/RequestsTable.js:42:50
   },
 ];
 
-export default function UsersTable({ requests }) {
-  return (
-    <OurTable data={requests} columns={columns} testid={"RequestsTable"} />
-  );
-}
+export default function UsersTable({ requests }) {}
 
killedBy: RequestsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Requests/RequestsTable.js:44:57
 
 export default function UsersTable({ requests }) {
   return (
-    <OurTable data={requests} columns={columns} testid={"RequestsTable"} />
+    <OurTable data={requests} columns={columns} testid={""} />
   );
 }
killedBy: RequestsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
