[Killed] BlockStatement
main/components/Nav/Footer.js:3:34
 import { Container } from "react-bootstrap";
 
-export default function Footer() {
-  return (
-    <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5" data-testid="Footer">
-      <Container>
-        <p>
-          Built by students using React and Spring Boot ❤️ See the source code
-          on{" "}
-          <a href="https://github.com/ucsb-cs156-f24/proj-rec-f24-07">Github</a>
-          .
-        </p>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer() {}
 
killedBy: Footer tests renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Footer"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
