[Killed] BlockStatement
src/main/pages/HomePage.js:4:36
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useCurrentUser } from "main/utils/currentUser";
 
-export default function HomePage() {
-  const { data: currentUser } = useCurrentUser();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Welcome!</h1>
-        <p>
-          This is a webapp that allows students to submit different types of
-          requests to professors at the University of California, Santa Barbara.
-          {currentUser && currentUser.loggedIn
-            ? " Navigate to the requests tab to get started."
-            : " Please log in to get started."}
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HomePage() {}
 
killedBy: HomePage tests renders without crashing
statusReason: Error: Unable to find an element with the text: /Welcome!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ConditionalExpression
src/main/pages/HomePage.js:14:12
         <p>
           This is a webapp that allows students to submit different types of
           requests to professors at the University of California, Santa Barbara.
-          {currentUser && currentUser.loggedIn
+          {false
             ? " Navigate to the requests tab to get started."
             : " Please log in to get started."}

[Survived] ConditionalExpression
src/main/pages/HomePage.js:14:12
         <p>
           This is a webapp that allows students to submit different types of
           requests to professors at the University of California, Santa Barbara.
-          {currentUser && currentUser.loggedIn
+          {true
             ? " Navigate to the requests tab to get started."
             : " Please log in to get started."}
