[Killed] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom";
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery(
-    "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-      }
-    },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    }
-  );
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _currentUser.useCurrentUser)(...)' as it is undefined.

[Killed] ObjectLiteral
src/main/utils/currentUser.js:23:5
         console.error("Error invoking axios.get: ", e);
       }
     },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    }
+    {}
   );
 }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'loggedIn')
